Protocentral/protocentral-pulse-express/src/max32664.cpp
//////////////////////////////////////////////////////////////////////////////////////////
//
//  Arduino library for the ProtoCentral Pulse Express breakout board
//  (MAX30102 optical sensor + MAX32664D biometric sensor hub).
//
//  See max32664.h for the public API and UG6921 Rev 2 (Maxim/ADI) for the
//  underlying I2C command set.
//
//  Original 2020 driver: Joice Tm, Copyright (c) 2020 ProtoCentral
//  Modernised rewrite:   Copyright (c) 2025 ProtoCentral Electronics
//
//  This software is licensed under the MIT License (http://opensource.org/licenses/MIT).
//
//  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
//  INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
//  PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
//  HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION
//  OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
//  SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//  For information on how to use, visit https://github.com/Protocentral/protocentral-pulse-express
//
/////////////////////////////////////////////////////////////////////////////////////////

#include "max32664.h"

#include <stdarg.h>
#include <stdio.h>
#include <string.h>

/////////////////////////////////////////////////////////////////////////////////////////
// Internal constants
/////////////////////////////////////////////////////////////////////////////////////////

namespace
{

// Per-command CMD_DELAY values from UG6921 Tables 2/5/6, biased upward to
// match what the original 1.0.x driver shipped (uniform 45 ms + extra ad-hoc
// delays). UG6921 §1.1 quotes a 2 ms default; in practice the hub returns
// 0xFE (busy) on commands that proxy to the MAX30101 over its secondary I2C
// bus when the host polls that aggressively, and the doc itself recommends
// "Increase the CMD_DELAY" as the remedy. We err on the safe side here and
// rely on writeImpl()/readImpl() retry-on-0xFE for residual races.
constexpr uint16_t kDefaultCmdDelayMs       = 10;
constexpr uint16_t kSetDateTimeDelayMs      = 10;
constexpr uint16_t kSetCalIndexDelayMs      = 10;
constexpr uint16_t kSetSpo2CoeffsDelayMs    = 10;
constexpr uint16_t kCalibVectorChunkDelayMs = 30;
constexpr uint16_t kEnableAgcDelayMs        = 30;
constexpr uint16_t kEnableAfeDelayMs        = 60;
constexpr uint16_t kEnableBptDelayMs        = 600;
constexpr uint16_t kDisableAfeDelayMs       = 60;
constexpr uint16_t kDisableBptDelayMs       = 600;
constexpr uint16_t kDisableAgcDelayMs       = 30;
constexpr uint16_t kPostEnableSettleMs      = 200;
constexpr uint16_t kResetSettleMs           = 1500;
constexpr uint16_t kEnterAppModeDelayMs     = 20;
constexpr uint16_t kRawModeSettleMs         = 250;
// LED-current writes (0x40/0x03/RegAddr/Val) proxy to the MAX30101 over the
// hub's secondary I2C bus — give them substantial headroom over the default.
constexpr uint16_t kLedCurrentDelayMs       = 25;

// Retry policy for 0xFE responses. UG6921 §1.1 says "Device is busy. Try
// again. Increase the CMD_DELAY." We retry up to kBusyRetryMax times and
// double the post-write delay each attempt (capped at kBusyMaxDelayMs).
constexpr uint8_t  kBusyRetryMax            = 4;
constexpr uint16_t kBusyMaxDelayMs          = 400;

// I2C chunk size for the long calibration-vector upload. Kept at 30 to match
// the AVR Wire BUFFER_LENGTH of 32 with two bytes of headroom; on platforms
// with larger buffers this still works since each chunk is its own I2C frame.
constexpr uint8_t  kCalibChunkBytes = 30;

// Read-side chunk: at most 30 payload bytes plus the 1-byte status header.
constexpr uint8_t  kReadChunkBytes = 30;

constexpr uint8_t kFifoIntrThreshold      = 0x0F;
constexpr uint8_t kOutputModeAlgo         = 0x03;
constexpr uint8_t kOutputModeSensorOnly   = 0x01;

// LED current registers on the MAX30101: 0x0C (LED1/red) and 0x0D (LED2/IR).
// Half-scale (0x7F) per UG6921 Table 6 §1.8/1.9.
constexpr uint8_t kMax30101Led1RegAddr    = 0x0C;
constexpr uint8_t kMax30101Led2RegAddr    = 0x0D;
constexpr uint8_t kMax30101LedHalfScale   = 0x7F;

inline uint16_t pack16BE(const uint8_t *p)
{
    return uint16_t((uint16_t(p[0]) << 8) | uint16_t(p[1]));
}

inline void packU32BE(uint32_t v, uint8_t out[4])
{
    out[0] = uint8_t((v >> 24) & 0xFF);
    out[1] = uint8_t((v >> 16) & 0xFF);
    out[2] = uint8_t((v >>  8) & 0xFF);
    out[3] = uint8_t( v        & 0xFF);
}

}  // namespace

/////////////////////////////////////////////////////////////////////////////////////////
// Construction & lifecycle
/////////////////////////////////////////////////////////////////////////////////////////

Max32664::Max32664(uint8_t resetPin, uint8_t mfioPin, TwoWire &bus)
    : _bus(bus), _resetPin(resetPin), _mfioPin(mfioPin)
{
}

bool Max32664::setDateTime(const Max32664DateTime &dt)
{
    if (dt.year < 2000 || dt.year > 2099)            return false;
    if (dt.month == 0 || dt.month > 12)              return false;
    if (dt.day == 0 || dt.day > 31)                  return false;
    if (dt.hour > 23 || dt.minute > 59 || dt.second > 59) return false;
    _now = dt;
    return true;
}

Max32664Status Max32664::begin()
{
    Max32664Status s = hardReset();
    if (s != Max32664Status::Ok) return s;

    s = enterAppMode();
    if (s != Max32664Status::Ok) return s;

    s = readFirmwareVersion(0x03, _hubVer);
    if (s != Max32664Status::Ok) return s;
    // Algorithm version is informational; ignore failure.
    readFirmwareVersion(0x07, _algoVer);

    _caps = capsFor(_hubVer);
    tracef("hub %u.%u.%u algo %u.%u.%u  vec=%u sample=%u %s%s",
           _hubVer.major, _hubVer.minor, _hubVer.patch,
           _algoVer.major, _algoVer.minor, _algoVer.patch,
           _caps.calibVectorBytes, _caps.sampleBytes,
           _caps.dateYYYYMMDD ? "YYYYMMDD " : "YYMMDD ",
           _caps.multiPointCalib ? "multi-point" : "single-point");

    // Anything outside the 40.x line is one of the A/B/C variants or a future
    // product — refuse rather than misdrive it.
    if (_hubVer.major != 40) return Max32664Status::UnsupportedFirmware;

    _began = true;
    return Max32664Status::Ok;
}

Max32664Status Max32664::hardReset()
{
    pinMode(_mfioPin,  OUTPUT);
    pinMode(_resetPin, OUTPUT);
    digitalWrite(_mfioPin,  HIGH);   // hold MFIO high to select application mode
    digitalWrite(_resetPin, LOW);
    delay(10);
    digitalWrite(_resetPin, HIGH);
    delay(kResetSettleMs);
    pinMode(_mfioPin, INPUT_PULLUP); // hub now drives MFIO as data-ready intr
    return Max32664Status::Ok;
}

