Protocentral/protocentral-pulse-express/src/max32664.cpp
Max32664Status Max32664::enterAppMode()
{
    // 0x01/0x00/0x00 — switch operating mode to application.
    Max32664Status s = writeCmd(0x01, 0x00, uint8_t(0x00), kEnterAppModeDelayMs);
    if (s != Max32664Status::Ok) return s;

    // 0x02/0x00 — read operating mode; expect 0x00 (application).
    uint8_t mode = 0xFF;
    s = readBytes(0x02, 0x00, &mode, 1);
    if (s != Max32664Status::Ok) return s;
    if (mode != 0x00) return Max32664Status::NotInAppMode;
    return Max32664Status::Ok;
}

Max32664Status Max32664::readFirmwareVersion(uint8_t indexByte, Max32664Version &out)
{
    uint8_t buf[3] = {0, 0, 0};
    Max32664Status s = readBytes(0xFF, indexByte, buf, sizeof(buf));
    if (s != Max32664Status::Ok) return s;
    out.major = buf[0];
    out.minor = buf[1];
    out.patch = buf[2];
    return Max32664Status::Ok;
}

Max32664Caps Max32664::capsFor(Max32664Version v) const
{
    Max32664Caps c;  // defaults are legacy values
    if (v.atLeast(40, 2, 2))
    {
        c.sendBpMedication = false;
        c.sendRestMode     = false;
    }
    if (v.atLeast(40, 5, 0))
    {
        c.calibVectorBytes = 512;
        c.sampleBytes      = 29;
        c.dateYYYYMMDD     = true;
        c.multiPointCalib  = true;
    }
    return c;
}

/////////////////////////////////////////////////////////////////////////////////////////
// BPT calibration mode
/////////////////////////////////////////////////////////////////////////////////////////

Max32664Status Max32664::startCalibration(const Max32664CalibrationRef &ref)
{
    if (!_began)                 return Max32664Status::NotConfigured;
    if (!_caps.multiPointCalib)  return Max32664Status::UnsupportedFirmware;
    if (ref.calIndex > 4)        return Max32664Status::InvalidArgument;

    Max32664Status s = sendDateTime();
    if (s != Max32664Status::Ok) return s;
    s = sendCalibrationRef(ref);
    if (s != Max32664Status::Ok) return s;

    s = setOutputMode(kOutputModeAlgo);            if (s != Max32664Status::Ok) return s;
    s = setFifoIntrThreshold(kFifoIntrThreshold);  if (s != Max32664Status::Ok) return s;
    s = enableAgc(true);                           if (s != Max32664Status::Ok) return s;
    s = enableAfe(true);                           if (s != Max32664Status::Ok) return s;
    s = enableBpt(0x01);                           if (s != Max32664Status::Ok) return s;
    delay(kPostEnableSettleMs);
    return Max32664Status::Ok;
}

Max32664Status Max32664::startCalibration(const Max32664LegacyCalibrationRefs &refs)
{
    if (!_began)                 return Max32664Status::NotConfigured;
    // Multi-point firmware rejects the deprecated 0x50/04/01 + 0x50/04/02 path.
    if (_caps.multiPointCalib)   return Max32664Status::UnsupportedFirmware;

    Max32664Status s = sendDateTime();
    if (s != Max32664Status::Ok) return s;
    s = sendLegacyCalibrationRefs(refs);
    if (s != Max32664Status::Ok) return s;

    s = setOutputMode(kOutputModeAlgo);            if (s != Max32664Status::Ok) return s;
    s = setFifoIntrThreshold(kFifoIntrThreshold);  if (s != Max32664Status::Ok) return s;
    s = enableAgc(true);                           if (s != Max32664Status::Ok) return s;
    s = enableAfe(true);                           if (s != Max32664Status::Ok) return s;
    s = enableBpt(0x01);                           if (s != Max32664Status::Ok) return s;
    delay(kPostEnableSettleMs);
    return Max32664Status::Ok;
}

Max32664Status Max32664::readSample(Max32664Sample &out)
{
    HubStatus st;
    Max32664Status s = readHubStatus(st);
    if (s != Max32664Status::Ok) return s;
    if (!st.dataReady) return Max32664Status::NoDataAvailable;

    uint8_t nn = 0;
    s = readNumFifoSamples(nn);
    if (s != Max32664Status::Ok) return s;
    if (nn == 0) return Max32664Status::NoDataAvailable;

    uint8_t buf[32];
    if (_caps.sampleBytes > sizeof(buf)) return Max32664Status::BufferTooSmall;
    s = readFifoSample(buf, _caps.sampleBytes);
    if (s != Max32664Status::Ok) return s;
    parseSample(buf, out);
    return Max32664Status::Ok;
}

Max32664Status Max32664::readCalibrationVector(uint8_t *out, size_t cap, size_t *written)
{
    if (!_began)                       return Max32664Status::NotConfigured;
    if (!out)                          return Max32664Status::InvalidArgument;
    if (cap < _caps.calibVectorBytes)  return Max32664Status::BufferTooSmall;

    // 0x51/0x04/0x03 — read user calibration vector.
    Max32664Status s = readBytes(0x51, 0x04, 0x03, out, _caps.calibVectorBytes);
    if (s != Max32664Status::Ok) return s;
    if (written) *written = _caps.calibVectorBytes;
    return Max32664Status::Ok;
}

/////////////////////////////////////////////////////////////////////////////////////////
// BPT estimation mode
/////////////////////////////////////////////////////////////////////////////////////////

Max32664Status Max32664::loadCalibrationVector(uint8_t calIndex, const uint8_t *vec, size_t len)
{
    if (!_began)                                       return Max32664Status::NotConfigured;
    if (!_caps.multiPointCalib)                        return Max32664Status::UnsupportedFirmware;
    if (calIndex > 4 || vec == nullptr || len != _caps.calibVectorBytes)
                                                       return Max32664Status::InvalidArgument;

    Max32664Status s = setCalIndex(calIndex);
    if (s != Max32664Status::Ok) return s;
    return sendCalibrationVectorChunked(vec, len);
}

Max32664Status Max32664::loadCalibrationVector(const uint8_t *vec, size_t len)
{
    if (!_began)                                       return Max32664Status::NotConfigured;
    if (_caps.multiPointCalib)                         return Max32664Status::UnsupportedFirmware;
    if (vec == nullptr || len != _caps.calibVectorBytes)
                                                       return Max32664Status::InvalidArgument;
    return sendCalibrationVectorChunked(vec, len);
}

Max32664Status Max32664::startEstimation(const Max32664Spo2Coeffs &coeffs)
{
    if (!_began) return Max32664Status::NotConfigured;

    Max32664Status s = sendDateTime();
    if (s != Max32664Status::Ok) return s;
    s = sendSpo2Coeffs(coeffs);
    if (s != Max32664Status::Ok) return s;

    s = setOutputMode(kOutputModeAlgo);            if (s != Max32664Status::Ok) return s;
    s = setFifoIntrThreshold(kFifoIntrThreshold);  if (s != Max32664Status::Ok) return s;
    s = enableAgc(true);                           if (s != Max32664Status::Ok) return s;
    s = enableAfe(true);                           if (s != Max32664Status::Ok) return s;
    s = enableBpt(0x02);                           if (s != Max32664Status::Ok) return s;
    delay(kPostEnableSettleMs);
    return Max32664Status::Ok;
}

Max32664Status Max32664::readSamples(Max32664Sample *out, size_t cap, size_t *count)
{
    if (count) *count = 0;
    if (!_began || out == nullptr) return Max32664Status::InvalidArgument;

    HubStatus st;
    Max32664Status s = readHubStatus(st);
    if (s != Max32664Status::Ok) return s;
    if (!st.dataReady) return Max32664Status::Ok;  // empty FIFO is not an error

    uint8_t nn = 0;
    s = readNumFifoSamples(nn);
    if (s != Max32664Status::Ok) return s;
    if (nn == 0) return Max32664Status::Ok;
    if (nn > cap) nn = uint8_t(cap);

    uint8_t buf[32];
    if (_caps.sampleBytes > sizeof(buf)) return Max32664Status::BufferTooSmall;

    for (uint8_t i = 0; i < nn; ++i)
    {
        s = readFifoSample(buf, _caps.sampleBytes);
        if (s != Max32664Status::Ok) return s;
        parseSample(buf, out[i]);
    }
    if (count) *count = nn;
    return Max32664Status::Ok;
}

/////////////////////////////////////////////////////////////////////////////////////////
// Raw PPG mode
/////////////////////////////////////////////////////////////////////////////////////////

Max32664Status Max32664::startRaw()
{
    if (!_began) return Max32664Status::NotConfigured;

    // Per UG6921 Table 6: output mode = sensor-only, then enable AFE, then
    // enable BPT in estimation mode (the algorithm runs but does not affect
    // PPG), then disable AGC so LED currents stay where the user puts them.
    Max32664Status s = setOutputMode(kOutputModeSensorOnly);
    if (s != Max32664Status::Ok) return s;
    s = setFifoIntrThreshold(kFifoIntrThreshold);  if (s != Max32664Status::Ok) return s;
    s = enableAfe(true);                           if (s != Max32664Status::Ok) return s;
    s = enableBpt(0x02);                           if (s != Max32664Status::Ok) return s;
    s = enableAgc(false);                          if (s != Max32664Status::Ok) return s;
    delay(kRawModeSettleMs);

    // LED1 (red) and LED2 (IR) currents to half-scale. Must come AFTER the
    // algorithm enable or the values are overwritten during init. The 0x40/03
    // family proxies to the MAX30101 over the secondary I2C bus, so it needs
    // more headroom than the trivial-command default.
    s = writeCmd3(0x40, 0x03, kMax30101Led1RegAddr, kMax30101LedHalfScale, 0,
                  kLedCurrentDelayMs);
    if (s != Max32664Status::Ok) return s;
    return writeCmd3(0x40, 0x03, kMax30101Led2RegAddr, kMax30101LedHalfScale, 0,
                     kLedCurrentDelayMs);
}

Max32664Status Max32664::readRaw(Max32664RawSample *out, size_t cap, size_t *count, bool wantRed)
{
    if (count) *count = 0;
    if (!_began || out == nullptr) return Max32664Status::InvalidArgument;

    HubStatus st;
    Max32664Status s = readHubStatus(st);
    if (s != Max32664Status::Ok) return s;
    if (!st.dataReady) return Max32664Status::Ok;

    uint8_t nn = 0;
    s = readNumFifoSamples(nn);
    if (s != Max32664Status::Ok) return s;
    if (nn == 0) return Max32664Status::Ok;
    if (nn > cap) nn = uint8_t(cap);

    // Per UG6921 Table 4 a sensor-only sample is 12 bytes (4 LEDs * 3 bytes).
    // Only LED1 (IR, bytes 0-2) and LED2 (Red, bytes 3-5) are wired up on the
    // MAX30101 in this product; LED3/4 are reported as zero.
    uint8_t buf[16];
    for (uint8_t i = 0; i < nn; ++i)
    {
        s = readFifoSample(buf, 12);
        if (s != Max32664Status::Ok) return s;
        out[i].ir  = (uint32_t(buf[0]) << 16) | (uint32_t(buf[1]) << 8) | uint32_t(buf[2]);
        out[i].red = wantRed
                       ? ((uint32_t(buf[3]) << 16) | (uint32_t(buf[4]) << 8) | uint32_t(buf[5]))
                       : 0u;
    }
    if (count) *count = nn;
    return Max32664Status::Ok;
}

