Protocentral/protocentral-pulse-express/src/max32664.cpp
Max32664Status Max32664::stop()
{
    if (!_began) return Max32664Status::Ok;
    // Disable order from UG6921 Tables 5 & 6 §3.
    Max32664Status s1 = enableAfe(false);
    Max32664Status s2 = enableBpt(0x00);
    Max32664Status s3 = enableAgc(false);
    if (s1 != Max32664Status::Ok) return s1;
    if (s2 != Max32664Status::Ok) return s2;
    return s3;
}

/////////////////////////////////////////////////////////////////////////////////////////
// Sub-procedures (private)
/////////////////////////////////////////////////////////////////////////////////////////

Max32664Status Max32664::sendDateTime()
{
    // Two 32-bit values: date then time. UG6921 Table 3 0x04 describes the
    // wire format as little-endian, and the worked example for the default
    // value (0xFE 0xA1 0x33 0x01 / 0x7C 0xD9 0x01 0x00 -> 20180101 / 121212)
    // confirms little-endian byte order.
    uint32_t date;
    if (_caps.dateYYYYMMDD)
    {
        date = uint32_t(_now.year)  * 10000u
             + uint32_t(_now.month) * 100u
             + uint32_t(_now.day);
    }
    else
    {
        // Legacy YYMMDD: take the last two digits of the year.
        uint16_t yy = _now.year % 100;
        date = uint32_t(yy)           * 10000u
             + uint32_t(_now.month)   * 100u
             + uint32_t(_now.day);
    }
    uint32_t time = uint32_t(_now.hour)   * 10000u
                  + uint32_t(_now.minute) * 100u
                  + uint32_t(_now.second);

    uint8_t payload[8];
    payload[0] = uint8_t( date        & 0xFF);
    payload[1] = uint8_t((date >>  8) & 0xFF);
    payload[2] = uint8_t((date >> 16) & 0xFF);
    payload[3] = uint8_t((date >> 24) & 0xFF);
    payload[4] = uint8_t( time        & 0xFF);
    payload[5] = uint8_t((time >>  8) & 0xFF);
    payload[6] = uint8_t((time >> 16) & 0xFF);
    payload[7] = uint8_t((time >> 24) & 0xFF);

    // 0x50/0x04/0x04 — set date/time. The trailing 0x04 is the configuration
    // index; payload follows.
    return writeCmd(0x50, 0x04, 0x04, payload, sizeof(payload), kSetDateTimeDelayMs);
}

Max32664Status Max32664::sendSpo2Coeffs(const Max32664Spo2Coeffs &c)
{
    // Each coefficient is round(10^5 * value) packed as a 32-bit signed
    // integer in MSB-first byte order (per the UG6921 worked example for A,
    // B, C in Table 5 step 1.5).
    auto toFixed = [](float v) -> int32_t {
        double scaled = double(v) * 100000.0;
        return int32_t(scaled >= 0 ? (scaled + 0.5) : (scaled - 0.5));
    };
    int32_t Ai = toFixed(c.a);
    int32_t Bi = toFixed(c.b);
    int32_t Ci = toFixed(c.c);

    uint8_t payload[12];
    packU32BE(uint32_t(Ai), &payload[0]);
    packU32BE(uint32_t(Bi), &payload[4]);
    packU32BE(uint32_t(Ci), &payload[8]);

    // 0x50/0x04/0x06 — set SpO2 calibration coefficients.
    return writeCmd(0x50, 0x04, 0x06, payload, sizeof(payload), kSetSpo2CoeffsDelayMs);
}

Max32664Status Max32664::sendCalibrationRef(const Max32664CalibrationRef &r)
{
    // 0x50/0x04/0x07 — set cal_index + reference systolic + reference
    // diastolic (introduced in 40.5.0+).
    uint8_t payload[3] = {r.calIndex, r.systolic, r.diastolic};
    return writeCmd(0x50, 0x04, 0x07, payload, sizeof(payload), kSetCalIndexDelayMs);
}

Max32664Status Max32664::sendLegacyCalibrationRefs(const Max32664LegacyCalibrationRefs &r)
{
    // 0x50/0x04/0x01 — three systolic refs.
    Max32664Status s = writeCmd(0x50, 0x04, 0x01, r.systolic, 3, kDefaultCmdDelayMs);
    if (s != Max32664Status::Ok) return s;
    // 0x50/0x04/0x02 — three diastolic refs.
    return writeCmd(0x50, 0x04, 0x02, r.diastolic, 3, kDefaultCmdDelayMs);
}

Max32664Status Max32664::setCalIndex(uint8_t idx)
{
    if (idx > 4) return Max32664Status::InvalidArgument;
    // 0x50/0x04/0x08 — select cal_index for subsequent vector load (40.5.0+).
    uint8_t payload[1] = {idx};
    return writeCmd(0x50, 0x04, 0x08, payload, 1, kSetCalIndexDelayMs);
}

Max32664Status Max32664::sendCalibrationVectorChunked(const uint8_t *vec, size_t len)
{
    if (vec == nullptr || len == 0) return Max32664Status::InvalidArgument;

    // The cal-vector upload is 0x50/0x04/0x03 followed by `len` raw bytes.
    // On most Arduino platforms the I2C buffer is too small to hold the whole
    // payload in one beginTransmission/endTransmission (AVR is 32 bytes,
    // ESP32 is 128, etc.), so we split the payload across multiple I2C frames.
    // The first frame carries the 3-byte command header; subsequent frames
    // are raw payload continuations that the hub firmware accumulates until
    // it has received `_caps.calibVectorBytes` bytes total and the host
    // issues a status read to terminate the transaction.
    size_t cursor = 0;
    bool   first  = true;
    while (cursor < len)
    {
        _bus.beginTransmission(MAX32664_I2C_ADDR);
        uint8_t inFrame = 0;
        if (first)
        {
            _bus.write(uint8_t(0x50));
            _bus.write(uint8_t(0x04));
            _bus.write(uint8_t(0x03));
            inFrame = 3;
            first   = false;
        }
        while (inFrame < kCalibChunkBytes && cursor < len)
        {
            _bus.write(vec[cursor++]);
            ++inFrame;
        }
        if (_bus.endTransmission() != 0) return Max32664Status::HostCommError;
        delay(kCalibVectorChunkDelayMs);
    }

    // Final status read confirms the upload was accepted by the hub.
    if (_bus.requestFrom(uint8_t(MAX32664_I2C_ADDR), uint8_t(1)) != 1)
        return Max32664Status::HostCommError;
    uint8_t status = uint8_t(_bus.read());
    if (status != 0x00) return Max32664Status(status);
    return Max32664Status::Ok;
}

Max32664Status Max32664::setOutputMode(uint8_t mode)
{
    return writeCmd(0x10, 0x00, mode, kDefaultCmdDelayMs);
}

Max32664Status Max32664::setFifoIntrThreshold(uint8_t th)
{
    return writeCmd(0x10, 0x01, th, kDefaultCmdDelayMs);
}

Max32664Status Max32664::enableAfe(bool on)
{
    return writeCmd(0x44, 0x03, uint8_t(on ? 0x01 : 0x00),
                    on ? kEnableAfeDelayMs : kDisableAfeDelayMs);
}

Max32664Status Max32664::enableAgc(bool on)
{
    return writeCmd(0x52, 0x00, uint8_t(on ? 0x01 : 0x00),
                    on ? kEnableAgcDelayMs : kDisableAgcDelayMs);
}

