Protocentral/protocentral-pulse-express/src/max32664.cpp
Max32664Status Max32664::enableBpt(uint8_t mode)
{
    // mode: 0=disabled, 1=calibration, 2=estimation.
    if (mode > 2) return Max32664Status::InvalidArgument;
    return writeCmd(0x52, 0x04, mode,
                    mode == 0 ? kDisableBptDelayMs : kEnableBptDelayMs);
}

/////////////////////////////////////////////////////////////////////////////////////////
// FIFO / sample I/O
/////////////////////////////////////////////////////////////////////////////////////////

Max32664Status Max32664::readHubStatus(HubStatus &out)
{
    uint8_t bits = 0;
    Max32664Status s = readBytes(0x00, 0x00, &bits, 1);
    if (s != Max32664Status::Ok) return s;
    out.sensorCommError = (bits & MAX32664_STATUS_SENSOR_COMM)  != 0;
    out.dataReady       = (bits & MAX32664_STATUS_DATA_READY)   != 0;
    out.fifoOutOverflow = (bits & MAX32664_STATUS_FIFO_OUT_OVR) != 0;
    out.fifoInOverflow  = (bits & MAX32664_STATUS_FIFO_IN_OVR)  != 0;
    out.deviceBusy      = (bits & MAX32664_STATUS_DEVICE_BUSY)  != 0;
    return Max32664Status::Ok;
}

Max32664Status Max32664::readNumFifoSamples(uint8_t &nn)
{
    return readBytes(0x12, 0x00, &nn, 1);
}

Max32664Status Max32664::readFifoSample(uint8_t *out, size_t len)
{
    return readBytes(0x12, 0x01, out, len);
}

void Max32664::parseSample(const uint8_t *buf, Max32664Sample &s) const
{
    // Layout per UG6921 Table 4. Bytes 0..11 are MAX30101 PPG counters in
    // algorithm mode; byte 12 onward is the BPT block.
    s.bpStatus     = Max32664BpStatus(buf[12]);
    s.progress     = buf[13];
    s.heartRate10x = pack16BE(&buf[14]);
    s.systolic     = buf[16];
    s.diastolic    = buf[17];
    s.spo210x      = pack16BE(&buf[18]);
    s.rValue1000x  = pack16BE(&buf[20]);
    s.pulseFlag    = buf[22];

    // 40.5.0+ extension fields. Zeroed when caps reports a smaller sample
    // size so user code can rely on a consistent struct layout.
    s.ibiMs          = (_caps.sampleBytes >= 25) ? pack16BE(&buf[23]) : 0;
    s.spo2Confidence = (_caps.sampleBytes >= 26) ? buf[25] : 0;
    s.bptReportFlag  = (_caps.sampleBytes >= 27) ? buf[26] : 0;
    s.spo2ReportFlag = (_caps.sampleBytes >= 28) ? buf[27] : 0;
}

/////////////////////////////////////////////////////////////////////////////////////////
// Low-level I2C primitives
/////////////////////////////////////////////////////////////////////////////////////////

// All command transactions go through writeImpl()/readImpl(), which:
//   - send the pre-built command frame on the I2C bus,
//   - delay CMD_DELAY,
//   - read the hub status byte (and any payload, for the read variant),
//   - retry up to kBusyRetryMax times on 0xFE (busy), doubling the delay
//     each attempt up to kBusyMaxDelayMs.
// Per UG6921 §1.1: "0xFE: Device is busy. Try again. Increase the CMD_DELAY."

Max32664Status Max32664::writeImpl(const uint8_t *frame, size_t frameLen, uint16_t cmdDelayMs)
{
    uint16_t actualDelay = cmdDelayMs ? cmdDelayMs : kDefaultCmdDelayMs;

    for (uint8_t attempt = 0; attempt <= kBusyRetryMax; ++attempt)
    {
        _bus.beginTransmission(MAX32664_I2C_ADDR);
        for (size_t i = 0; i < frameLen; ++i) _bus.write(frame[i]);
        if (_bus.endTransmission() != 0)
        {
            tracef("write fam=0x%02X idx=0x%02X i2c-nack",
                   frameLen > 0 ? frame[0] : 0, frameLen > 1 ? frame[1] : 0);
            return Max32664Status::HostCommError;
        }
        delay(actualDelay);
        if (_bus.requestFrom(uint8_t(MAX32664_I2C_ADDR), uint8_t(1)) != 1)
            return Max32664Status::HostCommError;
        uint8_t st = uint8_t(_bus.read());

        if (st == 0x00) return Max32664Status::Ok;
        if (st != 0xFE)
        {
            tracef("write fam=0x%02X idx=0x%02X status=0x%02X",
                   frameLen > 0 ? frame[0] : 0, frameLen > 1 ? frame[1] : 0, st);
            return Max32664Status(st);
        }
        if (attempt == kBusyRetryMax)
        {
            tracef("write fam=0x%02X idx=0x%02X 0xFE busy after %u retries",
                   frameLen > 0 ? frame[0] : 0, frameLen > 1 ? frame[1] : 0, attempt);
            return Max32664Status::DeviceBusy;
        }
        actualDelay = (actualDelay < kBusyMaxDelayMs / 2)
                          ? uint16_t(actualDelay * 2u)
                          : kBusyMaxDelayMs;
    }
    return Max32664Status::DeviceBusy;
}

Max32664Status Max32664::readImpl(const uint8_t *frame, size_t frameLen,
                                  uint8_t *out, size_t outLen, uint16_t cmdDelayMs)
{
    uint16_t actualDelay = cmdDelayMs ? cmdDelayMs : kDefaultCmdDelayMs;

    for (uint8_t attempt = 0; attempt <= kBusyRetryMax; ++attempt)
    {
        _bus.beginTransmission(MAX32664_I2C_ADDR);
        for (size_t i = 0; i < frameLen; ++i) _bus.write(frame[i]);
        if (_bus.endTransmission() != 0)
        {
            tracef("read fam=0x%02X idx=0x%02X i2c-nack",
                   frameLen > 0 ? frame[0] : 0, frameLen > 1 ? frame[1] : 0);
            return Max32664Status::HostCommError;
        }
        delay(actualDelay);

        // Drain (1 + outLen) bytes across as many requestFrom() calls as the
        // platform's Wire buffer requires. The leading byte is the status; on
        // 0xFE we discard the rest of the chunk and retry the whole command.
        size_t   remaining   = outLen;
        uint8_t *cursor      = out;
        bool     firstChunk  = true;
        uint8_t  status      = 0;
        bool     transient   = false;

        while (remaining > 0 || firstChunk)
        {
            uint16_t want = uint16_t((firstChunk ? 1u : 0u) + remaining);
            if (want > kReadChunkBytes) want = kReadChunkBytes;
            uint8_t got = _bus.requestFrom(uint8_t(MAX32664_I2C_ADDR), uint8_t(want));
            if (got != want) return Max32664Status::HostCommError;

            if (firstChunk)
            {
                status = uint8_t(_bus.read());
                --got;
                firstChunk = false;
                if (status != 0x00)
                {
                    while (got--) _bus.read();
                    transient = (status == 0xFE);
                    break;
                }
            }
            while (got-- && remaining > 0)
            {
                *cursor++ = uint8_t(_bus.read());
                --remaining;
            }
            if (remaining == 0) break;
        }

