Protocentral/protocentral-pulse-express/src/max32664.cpp
        if (status == 0x00) return Max32664Status::Ok;
        if (!transient)
        {
            tracef("read fam=0x%02X idx=0x%02X status=0x%02X",
                   frameLen > 0 ? frame[0] : 0, frameLen > 1 ? frame[1] : 0, status);
            return Max32664Status(status);
        }
        if (attempt == kBusyRetryMax)
        {
            tracef("read fam=0x%02X idx=0x%02X 0xFE busy after %u retries",
                   frameLen > 0 ? frame[0] : 0, frameLen > 1 ? frame[1] : 0, attempt);
            return Max32664Status::DeviceBusy;
        }
        actualDelay = (actualDelay < kBusyMaxDelayMs / 2)
                          ? uint16_t(actualDelay * 2u)
                          : kBusyMaxDelayMs;
    }
    return Max32664Status::DeviceBusy;
}

Max32664Status Max32664::writeCmd(uint8_t fam, uint8_t idx, uint16_t cmdDelayMs)
{
    uint8_t frame[2] = {fam, idx};
    return writeImpl(frame, 2, cmdDelayMs);
}

Max32664Status Max32664::writeCmd(uint8_t fam, uint8_t idx, uint8_t v0, uint16_t cmdDelayMs)
{
    uint8_t frame[3] = {fam, idx, v0};
    return writeImpl(frame, 3, cmdDelayMs);
}

Max32664Status Max32664::writeCmd(uint8_t fam, uint8_t idx, uint8_t v0, uint8_t v1,
                                  uint16_t cmdDelayMs)
{
    uint8_t frame[4] = {fam, idx, v0, v1};
    return writeImpl(frame, 4, cmdDelayMs);
}

Max32664Status Max32664::writeCmd3(uint8_t fam, uint8_t idx,
                                   uint8_t v0, uint8_t v1, uint8_t v2,
                                   uint16_t cmdDelayMs)
{
    uint8_t frame[5] = {fam, idx, v0, v1, v2};
    return writeImpl(frame, 5, cmdDelayMs);
}

Max32664Status Max32664::writeCmd(uint8_t fam, uint8_t idx,
                                  const uint8_t *payload, size_t len,
                                  uint16_t cmdDelayMs)
{
    // Inline assemble: max payload across callers is 12 bytes (SpO2 coeffs).
    uint8_t frame[16];
    if (2 + len > sizeof(frame)) return Max32664Status::BufferTooSmall;
    frame[0] = fam;
    frame[1] = idx;
    for (size_t i = 0; i < len; ++i) frame[2 + i] = payload[i];
    return writeImpl(frame, 2 + len, cmdDelayMs);
}

Max32664Status Max32664::writeCmd(uint8_t fam, uint8_t idx, uint8_t sub,
                                  const uint8_t *payload, size_t len,
                                  uint16_t cmdDelayMs)
{
    uint8_t frame[16];
    if (3 + len > sizeof(frame)) return Max32664Status::BufferTooSmall;
    frame[0] = fam;
    frame[1] = idx;
    frame[2] = sub;
    for (size_t i = 0; i < len; ++i) frame[3 + i] = payload[i];
    return writeImpl(frame, 3 + len, cmdDelayMs);
}

Max32664Status Max32664::readBytes(uint8_t fam, uint8_t idx,
                                   uint8_t *out, size_t len, uint16_t cmdDelayMs)
{
    uint8_t frame[2] = {fam, idx};
    return readImpl(frame, 2, out, len, cmdDelayMs);
}

Max32664Status Max32664::readBytes(uint8_t fam, uint8_t idx, uint8_t sub,
                                   uint8_t *out, size_t len, uint16_t cmdDelayMs)
{
    uint8_t frame[3] = {fam, idx, sub};
    return readImpl(frame, 3, out, len, cmdDelayMs);
}

/////////////////////////////////////////////////////////////////////////////////////////
// Tracing
/////////////////////////////////////////////////////////////////////////////////////////

void Max32664::trace(const char *msg) const
{
    if (_dbg) _dbg->println(msg);
}

void Max32664::tracef(const char *fmt, ...) const
{
    if (!_dbg) return;
    char buf[128];
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(buf, sizeof(buf), fmt, ap);
    va_end(ap);
    _dbg->println(buf);
}
